<div class="container">
    <div class="breadcrumb-wrapper is-article">
        <ul class="breadcrumb">
            <li class="breadcrumb-item home">
                <a class="breadcrumb-link" title="Главная" href="/">Главная</a>
            </li>
            <li class="breadcrumb-item">
                <a class="breadcrumb-link" title='Основы дизайна онбординга и пошаговая инструкция по созданию приветственного экрана' href="/blogs/blog/osnovy-dizayna-onbordinga/">Основы дизайна онбординга и пошаговая инструкция по созданию приветственного экрана</a>
            </li>
        </ul>
    </div>
</div>
<div class="container">
    <div class="article-content article-{{ article.url | split: '/' | last }}">
        <div class="row is-grid">
            <div class="article-inner cell-9 cell-8-lg cell-12-m grid-8 padded-right m-grid-12 s-grid-12">
                <!-- Article content -->
                <h1 class="article-title">ОСНОВЫ ДИЗАЙНА ОНБОРДИНГА И ПОШАГОВАЯ ИНСТРУКЦИЯ ПО СОЗДАНИЮ ПРИВЕТСТВЕННОГО ЭКРАНА</h1>
                <div class="article-text editor">
                    <p>С каждым годом удивлять пользователей удобным интерфейсом становится всё тяжелее. Они привыкли пользоваться крутыми инструментами крупных компаний для решения своих задач, поэтому анимация и необычные иллюстрации уже никого не впечатляют. При этом пользовательский опыт остаётся важнейшим критерием оценки качества цифрового продукта.</p>
                    <p><strong>В новой статье поговорим об инструменте, который помогает увеличить интерес к интерфейсу и повысить вовлечённость.</strong> Если хотите выпустить новое приложение на рынок или разрабатываете сайт для решения коммерческих задач, материал будет вам полезен.</p>
                    <h2>Что такое онбординг</h2>
                    <p>У этого термина есть несколько определений, но мы остановимся на самом популярном. <strong>Онбординг — приветственный экран</strong>, который пользователи видят после установки приложения или выполнения целевого действия на сайте.</p>
                    <p>Допустим, пользователь искал информацию о мясных консервах для собак и попал на сайт интернет-магазина. Ему понравилась структура каталога и он решил зарегистрироваться, чтобы позже оформить заказ. <strong>После создания профиля ему предложили пройти ознакомительный тур по сайту.</strong></p>
                    <p><strong>Многие новички путают онбординг с туром по системе.</strong> Виртуальный тур и онбординг выполняют похожие задачи, но это разные инструменты. Можно сказать, что onboarding — катализатор, который подталкивает пользователя к прохождению виртуального тура.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6370/16677090/original/1_fda47ba8c29a1184853f28fbaf93dbfe.jpg" alt="" width="1000"></p>
                    <p><strong>В приложениях онбординг представляет собой стартовый экран</strong>, который используется для рассказа о самых важных функциях приложения. Например, когда мы устанавливаем приложение интернет-магазина, нам рассказывают о том, как оформить заказ, оплатить заказ баллами и использовать голосовой поиск.</p>
                    <p>В обычных условиях человек мог и не узнать о том, что в приложении поддерживается голосовой ввод запроса в поисковую форму, а после знакомства с онбордингом эта информация отложится на подсознательном уровне. И в нужный момент она может всплыть в памяти.</p>
                    <p>Многие коммерческие компании в процессе работы над цифровым продуктом исключают онбординг из списка задач. Они концентрируются на анимации, иллюстрациях, цвете главного меню и упускают из вида важные детали. <strong>После релиза оказывается, что большинство пользователей закрывают приложение через несколько минут после установки.</strong></p>
                    <p>Проблема в том, что оно кажется слишком сложным? по сравнению с инструментами, которые уже есть на рынке. Пользователям сложно переучиваться и у них нет мотивации, чтобы пойти на этот рискованный шаг. Возможно, приложение только кажется крутым, а на самом деле в нём нет ничего принципиально нового.</p>
                    <p>В этом случае на онбординге можно разместить 3-4 небольших экрана с краткой презентацией продукта. <strong>Если сфокусировать внимание аудитории на важных функциях, длительность сеанса точно увеличится.</strong> И гораздо меньше людей удалят приложение после первого знакомства.</p>
                    <p>Качественный онбординг особенно важен для сложных продуктов. Если компания ставит перед собой конкретные коммерческие цели, ей надо сделать интерфейс, который обеспечит максимальную конверсию. Каждый пользователь, который закроет приложение или вкладку с сайтом, мог бы принести прибыль.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6387/16677107/original/2_6b9f4f8c8f3d4644d75341ec1f7d933b.jpg" width="1000 " height="687"></p>
                    <p><strong>Главное преимущество онбординга в том, что он не выглядит навязчивым.</strong> Конечно, если не делать его в виде всплывающего окна, которое блокирует основной контент. Нативное размещение позволит погрузить максимальное количество пользователей в суть продукта и управлять их вниманием.</p>
                    <p>Представим, что компания разрабатывает приложение для поиска недвижимости с уникальной функцией — каталогом на основе геолокации. Пользователь открывает доступ к местоположению и видит список объектов, которые сдаются в том же районе.</p>
                    <p><strong>Эта функция может стать серьёзным конкурентным преимуществом</strong> и идеальным катализатором для быстрого проникновения на рынок. Если представители целевой аудитории не узнают о поиске на основе геолокации до установки приложения и этой информации не будет на онбординге, у них будет меньше оснований для знакомства с продуктом.</p>
                    <p>Некоторые установят приложение, чтобы протестировать конкретно эту функцию, а другие заинтересуются им потому, что увидят фокус разработчиков на решении задач аудитории. Дальнейшая судьба взаимодействия заинтересованного пользователя с продуктом зависит от подхода к проектированию UI.</p>
                    <p><strong>Будет справедливо отметить, что ознакомительный тур — далеко не свежая фишка.</strong> Её используют постоянно, поэтому рассчитывать на вау-эффект не стоит. Хотя если уделить внимание проектированию важной части интерфейса, то заинтересовать пользователей точно получится.</p>
                    <p>Найти идеальную формулу для онбординга получится только в результате экспериментов. Если сократите процесс до одного шага, то сконцентрируйтесь на главных фишках, которые отличают новый продукт от решений, которые уже есть на рынке.&nbsp;</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6398/16677118/original/3_5e907cfba263e4f3ad250b1b8f11dcfd.jpg" width="900" height="664"></p>
                    <p><strong>При проектировании онбординга опирайтесь на конкретное действие.</strong> В голове у специалиста, который будет разрабатывать структуру приветственного экрана, должен сложиться пазл. Например, после знакомства с поиском недвижимости на основе геолокации, пользователь должен открыть доступ к местоположению и потратить время на просмотр каталога.</p>
                    <h3>Какие задачи решает онбординг</h3>
                    <p>Мы уже частично ответили на этот вопрос, но так как он очень важен, остановимся на нём подробно. Прежде чем переходить к разработке интерфейса, определите главные точки опоры для будущего продукта. Без этого дальнейшие действия не имеют смысла.</p>
                    <p>Предположим, что подготовительная работа завершена и наступает время перейти к практическим действиям. Дизайнер проектирует каркас и последовательно «укладывает» на него блоки. Это можно сравнить со строительством высотки. <strong>Сначала появляется фундамент, а потом постепенно вырастают этажи.</strong></p>
                    <p>Онбординг выступает в роли «раствора», надёжно скрепляющего элементы между собой. Это глобальная задача, которую решает контент, размещённый на приветственном экране.</p>
                    <p><strong>Дополнительные задачи:</strong></p>
                    <ol>
                        <li><strong>Быстрое погружение в продукт.</strong> Чем меньше времени уходит на базовое знакомство, тем лучше для пользователя.</li>
                        <li><strong>Удержание внимания.</strong> Если ниша перегрета конкурентами, то пользователи не готовы уделять много времени новому продукту.</li>
                        <li><strong>Знакомство с главными функциями.</strong> Аудитория должна понимать, почему ей надо обратить внимание на новое приложение или только что запущенный сайт.</li>
                        <li><strong>Повышение вовлечённости.</strong> Если продукт может предложить уникальные функции, лояльность аудитории автоматически увеличится.</li>
                    </ol>
                    <p>Если в приложении или на сайте нет онбординга, который погружает пользователей в особенности цифрового продукта, это не значит, что он плохой. Просто шансы на получение постоянного клиента заметно снижаются.</p>
                    <p><strong>Онбординг — не только приветственный экран.</strong> К этому собирательному понятию можно отнести любые элементы, которые помогают пользователям лучше понять, как пользоваться инструментами. Например, подсказки и уведомления тоже являются частью онбординга.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6405/16677125/original/4_b4c1af194365c84422538c5b9624e219.jpg" width="900" height="689"></p>
                    <p>Универсальной формулы для приложений и сайтов нет, поэтому придётся найти её экспериментальным путём. Заранее подготовьтесь к сложным задачам и рутине, потому что проектирование онбординга — это не выбор цветов или гармоничных шрифтов.</p>
                    <p><strong>Анализ референсов и другие стандартные инструменты помогут</strong>, но поиск оптимального решения может затянуться надолго. Например, в некоторых приложениях ознакомительные туры используются не только после установки, а постоянно в момент использования новых функций.</p>
                    <p>К примеру, если пользователь не пользовался формой поиска недвижимости на основе геолокации, а сейчас перешёл в соответствующий раздел, небольшая помощь ему не помешает. Знакомство продолжится только если преподнести ознакомительный тур ненавязчиво.</p>
                    <p><strong>Onboarding может как увеличить конверсию и продолжительность сеанса, так и разрушить пользовательский опыт.</strong> Представьте, что установили приложение для заказа еды, создали учётную запись, а приветственный экран появляется при каждом открытии приложения.</p>
                    <p>Такая ситуация не понравится никому, поэтому надо сделать всё, чтобы защититься от критических ошибок. Неправильно выстроенный онбординг может вызывать негативную реакцию и расстроенные пользователи вряд ли захотят дать продукту второй шанс.</p>
                    <p>Процесс погружения целевой аудитории в продукт должен быть таким, чтобы интерес к нему рос одновременно с пролистыванием экрана приветственного тура. Если они выстроены в правильном порядке, добиться эффекта будет несложно. <strong>Главное — не потерять доверие пользователей.</strong></p>
                    <p>Ещё онбординг помогает снизить нагрузку на менеджеров или техническую поддержку. Если в момент прохождения тура по системе пользователи поймут, как использовать полезную функцию, они не будут забрасывать поддержку дополнительными вопросами.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6413/16677133/original/5_8324792fd5da744dd7836fcc17c7c6cc.jpg" width="922" height="767"></p>
                    <p><strong>Первое время после релиза продукта есть смысл провести серию A/B-тестов с подключением онбординга.</strong> Если по результатам эксперимента станет понятно, что онбординг увеличивает время визита и конверсию в покупку, оставьте его на постоянной основе.</p>
                    <p>При возникновении негативной реакции, лучше отказаться от него и сконцентрироваться на добавлении важных функций или спроектировать другую структуру. <strong>Такой подход позволит избавиться от критических проблем и быстрее получить отдачу от продукта.</strong></p>
                    <h2>Популярные техники онбординга</h2>
                    <p>Если вникнуть в технические особенности онбординга, то <strong>у него есть две аудитории: «холодная» и «тёплая»</strong>. В первом случае контент помогает прогреть пользователей и мотивировать их на дальнейшее знакомство с продуктом. Во втором — усилить связь с интерфейсом.</p>
                    <p>Со второй категорией пользователей работать проще, потому что они уже знакомы с сайтом и приложением. А вот постепенно превращать «холодную» аудиторию в «тёплую» гораздо сложнее, потому что нужны эффективные инструменты для усиления мотивации.</p>
                    <p><strong>Разберём несколько популярных техник онбординга</strong>, которые можно использовать на постоянной основе для проектов разного формата. Выберите оптимальный вариант и сделайте его основным способом вовлечения аудитории в использование продукта.</p>
                    <h3>«Не хотите ознакомиться?»</h3>
                    <p>Один из самых часто используемых форматов, которые предполагает краткую презентацию сайта или приложения. После установки приложения или регистрации учётной записи на сайте появляется всплывающее окно с предложением потратить несколько минут на знакомство с системой.</p>
                    <p><strong>В случае положительного решения, пользователь увидит стандартный процесс погружения в продукт</strong> — затемнение экрана и подсказки по использованию элемента, который выделен ярким цветом. В некоторых случаях для расстановки акцентов используются анимированные маркеры.</p>
                    <p>В ознакомительной экскурсии нет ничего плохого, если правильно её спроектировать. Иногда сайты чересчур нагружают нового клиента информацией и у него появляется психологический барьер. Хочется как можно быстрее закрыть вкладку браузера и вернуться в комфортную среду.</p>
                    <p><strong>Чтобы избежать таких ситуаций, постарайтесь максимально сократить объём контента.</strong> Рассказывайте пользователям о самых важных функциях и акцентируйте их внимание на том, почему надо тратить на это время. Например, если в форме заказа есть нестандартные элементы, лучше показать, как правильно ими пользоваться.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6443/16677163/original/6_dd883385a39de8c85b7adaaeb87b7d9d.jpg" alt="" width="900"></p>
                    <h3>«Повторите действие»</h3>
                    <p>Шаблон повторения определённого действия хорош тем, что <strong>пользователь мгновенно погружается в процесс использования</strong>. И если у него в голове появится мысль, что «Инструмент крутой, надо использовать на постоянной основе», бизнес получит ещё лояльного клиента.</p>
                    <p>Главное, чтобы повторение действия было сделано с расчётом на конкретные задачи, а не просто потому что у конкурентов на онбординге есть аналогичные блоки. Например, после регистрации в Twitter появляется интерактивная подсказка с предложением добавить несколько человек, чтобы следить за обновлением контента.</p>
                    <p><strong>Шаблон в социальной сети спроектирован максимально просто</strong>, но он идеально работает в текущих условиях. Некоторые пользователи выполняют предложенные действия в автоматическом режиме и не задумываются о том, что за эти 5-10 секунд устанавливается прочная связь с продуктом.</p>
                    <h3>«Давайте настроим»</h3>
                    <p><strong>Ещё один популярный шаблон, который идеально работает на онбординге.</strong> Пользователь устанавливает приложение или регистрируется на сайте, и система предлагает адаптировать интерфейс под его задачи. К примеру, если речь идёт о сайте банка, то можно скрыть все разделы, которые не касаются депозитов.</p>
                    <p>Пользователь в несколько кликов избавляется от ненужных инструментов и формирует чистый UI, который можно использовать на постоянной основе. <strong>Такой подход решает сразу несколько задач:</strong> формирует положительные эмоции и усиливает лояльность по отношению к бренду.</p>
                    <p>Человек понимает, что банк не навязывает дополнительные услуги, а даёт полную свободу действий. Конечно, в таких нишах потенциальные клиенты руководствуются далеко не удобством интерфейса, но каждый плюс в «копилку» бренда может стать решающим.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6447/16677167/original/7_ef8911f4beb77dd1f5fe610d271334e9.jpg" alt="" width="900"></p>
                    <h3>«Посмотрите, как это работает»</h3>
                    <p>Шаблон похож на первую технику онбординга, но есть важное отличие. <strong>Пользователю по шагам показывают, как именно ведёт себя продукт в работе.</strong> Например, после регистрации в CRM система заполняется демо-данными и предприниматель может понять, как будет выглядеть структура после подгрузки его данных.</p>
                    <p>Ознакомление в режиме наблюдателя — это хорошо, но пользователь должен чётко понимать, какие задачи он сможет закрыть с помощью продукта. Если аналогичные инструменты есть у конкурентов, с которыми у него установлена прочная связь, понадобится более мощная мотивация.</p>
                    <p>Если хотите, чтобы у целевых посетителей с первых секунд знакомства сформировалось желание пользоваться инструментом на постоянной основе, создавайте практические шаблоны на онбординге. <strong>Это необязательно должны быть экскурсии на несколько часов</strong>, достаточно 2-3 инструкций по несколько минут каждая.</p>
                    <h2>Пошаговая инструкция по проектированию онбординга</h2>
                    <p>Предположим, что вы хотите выпустить на рынок приложение для хранения паролей и знаете все потребности пользователей. С интерфейсом и встроенными инструментами проблем нет — <strong>технологической «начинки» достаточно, чтобы победить всех конкурентов</strong>.</p>
                    <p>Воспользуйтесь пошаговой инструкцией по созданию онбординга, который поможет установить прочную связь между аудиторией и продуктом. <strong>Не забывайте адаптировать шаги под свою нишу и учитывать её особенности.</strong></p>
                    <h3>Сформулируйте цели</h3>
                    <p>У любого элемента в интерфейсе должна быть чёткая задача. В большинстве случаев онбординг создаётся, чтобы обеспечить лёгкое погружение в особенности сайта или приложения. <strong>Вы можете поставить любую цель</strong> — например, рассказать об угрозах, которые таит в себе интернет.</p>
                    <p>На приветственном экране можно разместить несколько графиков и текстовых подводок о вреде, которые хакеры наносят обычным пользователям. А в финальной карточке показать, что приложение поможет защитить пароли и решит другие проблемы с безопасностью.</p>
                    <p><strong>Старайтесь не перегружать приветственный экран, чтобы не возникло желание поскорее забыть о навязчивом продукте.</strong> Проектируйте структуру с фокусом на максимальную пользу для аудитории и сможете выполнить поставленные задачи.</p>
                    <p style="text-align: center;"><img src="https://cdn.idbi.ru/files/1/6469/16677189/original/8_2621d209eb75bdd546fa36ac86009b5e.jpg" alt="" width="900"></p>
                    <h3>Составьте список ключевых метрик</h3>
                    <p>Крутой онбординг будет бесполезен без инструментов, которые позволят отследить его эффективность. С<strong>оставьте список метрик для мониторинга, чтобы в режиме реального времени смотреть, как меняются показатели.</strong></p>
                    <p>Чаще всего для онбординга берут стандартные KPI — длительность визита, время до повторного сеанса, конверсию в целевое действие. Проводите тесты, чтобы сравнивать поведение пользователей с онбордингом и без него.</p>
                    <p>Если в процессе анализа увидите, что приветственный экран с туром по системе не влияет на вовлечённость, то лучше от него избавиться. Удаление всего лишнего — одно из главных правил создания эффективного интерфейса.</p>
                    <h3>Настройте сбор фидбека</h3>
                    <p>Не будет лишним спрашивать у пользователей, насколько информативный и полезный контент они видят на онбординге. Если окажется, что большинство респондентов поставили негативную оценку, пересмотрите структуру стартового экрана.</p>
                    <p>Собирать обратную связь можно разными способами, но <strong>лучше всего для этого подходят короткие формы с 1-2 полями</strong>. Лучше добавить в них эмодзи для выставления оценки в виде реакций. Пользователи давно привыкли взаимодействовать с визуальными элементами.</p>
                    <p><strong>Онбординг — незаменимый инструмент для дизайнеров и UX-проектировщиков</strong>, который помогает погрузить целевую аудиторию в продукт и превращает сложные вещи в простые. Используйте его силу с пользой для своих проектов.</p>
                    <p>Веб-студия <a href="https://idbi.ru/">IDBI</a> уделяет много времени пользовательскому опыту и знает, как создавать интерфейсы с высокой конверсией. Мы всегда на связи в рабочее время и готовы консультировать по любым вопросам, связанным с разработкой сайтов.</p>
                </div>
                <script src="https://yastatic.net/es5-shims/0.0.2/es5-shims.min.js"></script>
                <script src="https://yastatic.net/share2/share.js"></script>
                <div class="article-share">Поделиться <div class="ya-share2" data-services="collections,vkontakte,facebook,odnoklassniki,moimir,twitter,viber,whatsapp,telegram"></div>
                </div>
            </div>
            <div class="cell-3 cell-4-lg cell-12-m article-right-sidebar shit">
                <div class="row is-grid article-right-sidebar__wrap-form fixed pis">
                    <a href="https://idbi.ru" class="cell-12 article-right-sidebar__form-title">Заказать интернет-магазин под ключ</a>
                    <!-- Sidebar form -->
                    <?php require_once $_SERVER['DOCUMENT_ROOT'] . '/snippets/article-right-sidebar-form.tpl' ?>
                    <a href="https://idbi.ru" class="cell-12 cell-5-m cell-8-s cell-10-xs cell-12-mc push-2-s push-1-xs push-0-mc"><img src="/assets/images/idbi-img-2.jpg" alt="pic"></a>
                </div>
            </div>
            <div class="blog-right-column grid-4 m-grid-12 s-grid-12">
                <div class="row">
                    <div class="last-articles cell-12">
                        <div class="art-tags-title">Облако тэгов</div>
                        <div class="art-tags">
                            <a href="#" class="art-tag">Иллюстрации Фишки Виды сайтов 1</a>
                            <a href="#" class="art-tag">Иллюстрации Фишки Виды сайтов 2</a>
                            <a href="#" class="art-tag">Иллюстрации Фишки Виды сайтов 3</a>
                        </div>
                        <div class="aside-header art-title" style="padding-bottom:30px">
                            Популярные посты
                        </div>
                        <ul class="articles-list list-vertical">
                            <li class="list-item show-flex flex-middle">
                                <a href='{{ art.url }}' class="art-img" style="background-image: url(https://cdn.idbi.ru/images/articles/1/1089/1369153/large_98679.jpg)"></a>
                                <div class="art-wrap">
                                    <a href='#' class="art-date">21.05.2021</a>
                                    <a class="list-link art-link" href='#' title='Key visual в дизайне: особенности инструмента и советы по разработке'>Key visual в дизайне: особенности инструмента и советы по разработке</a>
                                </div>
                            </li>
                            <li class="list-item show-flex flex-middle">
                                <a href='{{ art.url }}' class="art-img" style="background-image: url(https://cdn.idbi.ru/images/articles/1/1089/1369153/large_98679.jpg)"></a>
                                <div class="art-wrap">
                                    <a href='#' class="art-date">14.05.2021</a>
                                    <a class="list-link art-link" href='#' title='Ментальные модели в дизайне интерфейсов + 5 советов по использованию'>Ментальные модели в дизайне интерфейсов + 5 советов по использованию</a>
                                </div>
                            </li>
                        </ul>
                    </div><!-- /.last-articles -->
                </div>
            </div>
        </div>
    </div>
</div>
<a href="#market-key" class="js-modal cookie-form" data-title="projectBlog"></a>
<script>
$(window).load(function() {
    $(".load-wrap").remove();


    console.log($.cookie('cookie_name'));

    if ($.cookie('cookie_name')) {
        console.log("Уже заходили");
    } else {
        console.log("Впервые у нас");
        $.cookie('cookie_name', 1, {
            expires: 1,
            path: '/'
        });

        function getCounter() {
            var counter = 0;
            return function() {
                return counter++;
            }
        }
        var count = getCounter();


        $(window).on('scroll', function() {
            var top = $(this).scrollTop();
            var place = $(document).height() / 3;
            if (top > place) {
                if (!count()) {
                    $(".cookie-form").click();
                }
            }
        })



    }

    console.log($.cookie('cookie_name'));

});
</script>